Tekla Open API Reference for Tekla Structures 2025
AnalysisPartCompositeProperties Class
 The AnalysisPartCompositeProperties class contains information related to analysis part composite properties.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Analysis.AnalysisPartCompositeProperties
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public sealed class AnalysisPartCompositeProperties
Public NotInheritable Class AnalysisPartCompositeProperties
The AnalysisPartCompositeProperties type exposes the following members.
Constructors
Name | Description
AnalysisPartCompositeProperties
Initializes a new instance of the AnalysisPartCompositeProperties class
Top
Properties
Name | Description
CompositeBeamSlabMaterial
 The composite beam slab material.
CompositeBeamSlabThickness
 The composite beam slab thickness.
CompositeBeamType
 The composite beam type.
CompositeBeamWidthFromSpanFactor
 The composite beam width from span factor.
CompositeBeamWidthLeft
 The composite beam width left.
CompositeBeamWidthModeLeft
 The composite beam width mode left.
CompositeBeamWidthModeRight
 The composite beam width mode right.
CompositeBeamWidthRight
 The composite beam width right.
Top
See Also
Reference
Tekla.Structures.Analysis Namespace